[
  {
    "Topic": "Columbia University - ATS Resume Builder (2025)",
    "Link": "github.com/nniishhh/ats-resume-builder",
    "Bullet": [
      "Built an ATS resume generation system using Vertex AI (Gemini) via LiteLLM that extracts job description signals, generates ATS bullets with 190–220 character validation and auto-repair loops, then compiles LaTeX into a final PDF (CLI + UI)."
    ]
  },
  {
    "Topic": "Email Prime (Amazon Bedrock Innovation Challenge, 2025)",
    "Link": "github.com/Amazon-Bedrock-Innovation-Challenge/email-prime",
    "Bullet": [
      "Built a Gmail-connected email intelligence app using AWS Bedrock with instructor and Pydantic schemas to classify threads and generate structured summaries; added RAG with Titan embeddings and FAISS retrieval plus incremental processing."
    ]
  },
  {
    "Topic": "Columbia University - Credit-Risk Modeling (Kalamata Capital Group, 2025)",
    "Link": "N/A",
    "Bullet": [
      "Built credit-risk models (XGBoost, CatBoost, regularized logistic regression) on 100K transactions with 200 engineered features, using TimeSeriesSplit cross-validation, and SHAP interpretability; achieved 0.82 AUC, accelerating underwriting decisions.",
      "Utilized Cursor for AI-assisted code generation and refactoring of the data pipeline, increasing velocity."
    ]
  },
  {
    "Topic": "Chulalongkorn University - Algorithmic FX Trading Strategy (2023)",
    "Link": "N/A",
    "Bullet": [
      "Designed an end-to-end FX trading pipeline with feature engineering (technical indicators, signals) and optimized ML classifiers (Random Forest, XGBoost) to predict profitable trade entries under risk–reward strategies, achieving 5.8% simulated net profit."
    ]
  },
  {
    "Topic": "Chulalongkorn University - Conversational Recommender System (2023)",
    "Link": "N/A",
    "Bullet": [
      "Launched an LLM-based conversational recommender in LangChain using GPT-3.5/FLAN-T5 for query understanding and response generation and Weaviate vector search for retrieval, achieving >70% single-turn accuracy with multi-turn support."
    ]
  }
]
